# RegEx Module

In [3]:
import re
txt = "The rain in Spain"
x = re.search("^The.*Spain$", txt)
if(x):
    print("YES! We have a match")
else:
    print("No match")

YES! We have a match

In [5]:
# findall() return a list containing all matches
import re
str = "The rain in Spain"
x = re.findall("ai", str)
print(x)

['ai', 'ai']

In [6]:
import re
str = "The rain in Spain"
x = re.findall("re", str)
print(x)

[]

In [41]:
# Search for white space character in the string  
import re
str = "The rain in Spain"
x = re.search("\s", str)
print("The first white-space character is located in position: ", x.start())

The first white-space character is located in position:  3

In [8]:
# Split at each white-space character
import re
str = "The rain in Spain"
x = re.split("\s", str)
print(x)

['The', 'rain', 'in', 'Spain']

In [9]:
# split the string only at first occurrence
import re
str = "The rain in Spain"
x = re.split("\s", str, 1)
print(x)

['The', 'rain in Spain']

In [10]:
# replace every white-space character with number 9
import re
str = "The rain in Spain"
x = re.sub("\s", "9", str)
print(x)

The9rain9in9Spain

In [11]:
# replace the first 2 occurrences
import re
str = "The rain in Spain"
x = re.sub("\s", "9", str, 2)
print(x)

The9rain9in Spain

In [12]:
# match object is an object containing information about the search 
and the result
import re
str = "The rain in Spain"
x = re.search("ai", str)
print(x)

<re.Match object; span=(5, 7), match='ai'>

In [14]:
# print the position (start- and end - position) of the first match
# occurances
import re
str = "The rain in Spain"
x = re.search(r"\bS\w+", str)
print(x.span())

(12, 17)

In [16]:
# print the string passed into the function
import re
str = "The rain in Spain"
x = re.search(r"\bS\w+", str)
print(x.string)

The rain in Spain

In [17]:
# print the part of the string where there was a match
import re
str = "The rain in Spain"
x = re.search(r"\bS\w+", str)
print(x.group())

Spain

In [18]:
# pattern --> any five letter string starting with a and ending with s
import re
pattern = '^a.......s$'
test_string = 'abyss'
result = re.match(pattern, test_string)

if result:
    print("Search successful...")
else:
    print("Search unsuccessful...")

Search unsuccessful...

In [19]:
# program to extract numbers from a string
import re
string = 'hello 12 hi 89. Howdy 34'
pattern = '\d+'

result = re.findall(pattern, string)
print(result)

['12', '89', '34']

In [20]:
# split the string
import re
string = 'Twelve:12 Eighty nine:89..'
pattern = '\d+'

result = re.split(pattern, string)
print(result)

['Twelve:', ' Eighty nine:', '..']

In [23]:
# create a DataFrame
import pandas as pd
df = pd.read_excel("C:\\Users\\iasms\\Desktop\\Python Prograamms\\Niyati\\Data Files\\Athletes.xlsx")
print(df)

                        Name      NOC           Discipline
0            AALERUD Katrine   Norway         Cycling Road
1                ABAD Nestor    Spain  Artistic Gymnastics
2          ABAGNALE Giovanni    Italy               Rowing
3             ABALDE Alberto    Spain           Basketball
4              ABALDE Tamara    Spain           Basketball
...                      ...      ...                  ...
11080  ZWICKER Martin Detlef  Germany               Hockey
11081      ZWOLINSKA Klaudia   Poland         Canoe Slalom
11082           ZYKOVA Yulia      ROC             Shooting
11083      ZYUZINA Ekaterina      ROC              Sailing
11084        ZYZANSKA Sylwia   Poland              Archery

[11085 rows x 3 columns]

In [24]:
# Pandas Extract
import numpy as np
df['first_five_Letter'] = df['Discipline'].str.extract(r'(^w{5})')
df.head()

                Name     NOC           Discipline first_five_Letter
0    AALERUD Katrine  Norway         Cycling Road               NaN
1        ABAD Nestor   Spain  Artistic Gymnastics               NaN
2  ABAGNALE Giovanni   Italy               Rowing               NaN
3     ABALDE Alberto   Spain           Basketball               NaN
4      ABALDE Tamara   Spain           Basketball               NaN

In [28]:
# Pandas Count
# count countries starting with letter N
S = pd.Series(['Norway', 'Colombia', 'Netherland', 'Japan', 'Puerto Rico', 'Russia', 'newyork'])
print(S[S.str.count(r'(^N.*)') == 1])
print("\n")
S.str.count(r'(^N.*)').sum()

0        Norway
2    Netherland
dtype: object

2

In [30]:
# Pandas match
# get countries starting with letter P
S = pd.Series(['Finland', 'Colombia', 'Florida', 'Japan', 'Pureto Rico', 'Russia', 'france'])
S[S.str.match(r'(^P.*)')==True]
print("\n")
df[df['NOC'].str.match('^P.*') == True]

,Name,NOC,Discipline,first_five_Letter
65,ABREU Diogo,Portugal,Trampoline Gymnastics,NaN
69,ABU RMILAH Wesam,Palestine,Judo,NaN
90,ADAMEK Klaudia,Poland,Athletics,NaN
91,ADAMKIEWICZ Patrycja,Poland,Taekwondo,NaN
95,ADAMUS Bartlomiej Stejan,Poland,Weightlifting,NaN
...,...,...,...,...
11053,ZIETARSKI Miroslaw,Poland,Rowing,NaN
11055,ZILLMANN Katarzyna,Poland,Rowing,NaN
11071,ZOU Jingyuan,People's Republic of China,Artistic Gymnastics,NaN
11081,ZWOLINSKA Klaudia,Poland,Canoe Slalom,NaN
11084,ZYZANSKA Sylwia,Poland,Archery,NaN

In [32]:
# Pandas Repalce

S = pd.Series(['Finland-1', 'Colombia-2', 'Florida-3', 'Japan-4', 'Pureto Rico-5', 'Russia-6', 'france-7'])
S.replace('-d', '', regex = True, inplace = True)
print(df)

                        Name      NOC           Discipline first_five_Letter
0            AALERUD Katrine   Norway         Cycling Road               NaN
1                ABAD Nestor    Spain  Artistic Gymnastics               NaN
2          ABAGNALE Giovanni    Italy               Rowing               NaN
3             ABALDE Alberto    Spain           Basketball               NaN
4              ABALDE Tamara    Spain           Basketball               NaN
...                      ...      ...                  ...               ...
11080  ZWICKER Martin Detlef  Germany               Hockey               NaN
11081      ZWOLINSKA Klaudia   Poland         Canoe Slalom               NaN
11082           ZYKOVA Yulia      ROC             Shooting               NaN
11083      ZYUZINA Ekaterina      ROC              Sailing               NaN
11084        ZYZANSKA Sylwia   Poland              Archery               NaN

[11085 rows x 4 columns]

In [40]:
# Pandas Contains
S = pd.Series(['Finland', 'Colombia', 'Florida', 'Japan', 'Pureto Rico', 'Russia', 'france'])
S.str.contains('^F.*')
# print("\n")
# df[df['S'].str.contains('^I.*')==True]

0     True
1    False
2     True
3    False
4    False
5    False
6    False
dtype: bool